--- a/README.md
+++ b/README.md
@@ -162,144 +177,187 @@ A sample (likely blood) drawn from a patient.
 
 ---
 
-```plantuml
+## Control Bead Result
 
-@startuml
-class "Patient"
+Describes a single bead with negative control, positive control or target HLA and the working sample, negative control serum or positive control serum applied within a solid phase panel assay.
 
-class "HLA Antibody Diagnostic Report" <<HLAAntibodyDiagnosticReport>>
-{
-DiagnosticReportId = 1937364874673
-}
-class "Laboratory-Organization" <<Laboratory>>
-{
-laboratoryId = 12393712
-name = HLA Laboratory
-}
-class "Working Sample" <<WorkingSample>>
-{
-workingSampleId = 3739373468
-patientSpecimenId = 4343847748
-}
-class Immunoassay-Interpretation <<Interpretation>>
-{
-negative-specificities = "HLA-A*01:01:01:01+HLA-A*24:02:01:01"
-positive-specificities = "HLA-A*01:01:01:01+HLA-A*24:02:01:01"
-questionable-specificities = "HLA-A*01:01:01:01+HLA-A*24:02:01:01"
-}
-class ImmunoassayBeadObservation1 <<Bead>>
-{
-beadId = 1001
-raw_mfi = 7650
-converted_mfi = 7500
-}
-class ImmunoassayBeadControlNeg1 <<NegativeControlBead>>
-{
-beadId = 1002
-raw_mfi = 650
-converted_mfi = 500
-}
-class ImmunoassayBeadControlPos1 <<PositiveControlBead>>
-{
-beadId = 1002
-raw_mfi = 6850
-converted_mfi = 8500
-}
-class ImmunoassayBeadObservation2 <<Bead>>
-{
-beadId = 1005
-raw_mfi = 7650
-converted_mfi = 7500
-}
-class ImmunoassayBeadControlNeg2 <<NegativeControlBead>>
-{
-beadId = 1006
-raw_mfi = 650
-converted_mfi = 500
-}
-class ImmunoassayBeadControlPos2 <<PositiveControlBead>>
-{
-beadId = 1007
-raw_mfi = 6050
-converted_mfi = 6000
-}
-class ImmunoassayBeadControlSerum1 <<PositiveControlSerum>>
-{
-specimenId = 10072433
-}    
-class ImmunoassayBeadControlSerum2 <<NegativeControlSerum>>
-{
-specimenId = 10072434
-}
-class Immunoassay-Kit <<Immunoassay-Kit>>
-{
-deviceId = 100238373678
-}
+### Elements
 
-"Patient" <-- "HLA Antibody Diagnostic Report"
-"HLA Antibody Diagnostic Report" <-- "Laboratory-Organization"
-"HLA Antibody Diagnostic Report" <-- "Working Sample"
-"HLA Antibody Diagnostic Report" <-- "Immunoassay-Interpretation"
-"HLA Antibody Diagnostic Report" <-- "Immunoassay-Kit"
-"HLA Antibody Diagnostic Report" <-- "ImmunoassayBeadObservation1"
-"ImmunoassayBeadObservation1" <-- "Working Sample"
-"ImmunoassayBeadObservation1" <-- "ImmunoassayBeadControlNeg1"
-"ImmunoassayBeadObservation1" <-- "ImmunoassayBeadControlPos1"
-"ImmunoassayBeadControlNeg1" <-- "ImmunoassayBeadControlSerum1"
-"ImmunoassayBeadControlPos1" <-- "ImmunoassayBeadControlSerum2"
-"HLA Antibody Diagnostic Report" <-- "ImmunoassayBeadObservation2"
-"ImmunoassayBeadObservation2" <-- "Working Sample"
-"ImmunoassayBeadObservation2" <-- "ImmunoassayBeadControlNeg2"
-"ImmunoassayBeadObservation2" <-- "ImmunoassayBeadControlPos2"
-"ImmunoassayBeadControlNeg2" <-- "ImmunoassayBeadControlSerum1"
-"ImmunoassayBeadControlPos2" <-- "ImmunoassayBeadControlSerum2"
-@enduml
@@
+
+## Element Relationships
+
+```mermaid
+
+classDiagram
+    class Patient {
+        +labRefId: 6898456
+    }
+
+    class HLAAntibodyDiagnosticReport {
+        +DiagnosticReportId: 1937364874673
+    }
+
+    class LaboratoryOrg {
+        +laboratoryId: 12393712
+        +name: HLA Laboratory
+    }
+
+    class WorkingSample {
+        +workingSampleId: 3739373468
+        +patientSpecimenId: 4343847748
+        +treatment: Dilution
+        +Diluent: Water
+        +Ratio: 0.5
+    }
+
+    class ImmunoassayInterpretation {
+        +negative-specificities: "HLA-A*01:01+HLA-A*24:02"
+        +positive-specificities: "HLA-A*01:01+HLA-A*24:02"
+        +questionable-specificities: "HLA-A*01:01+HLA-A*24:02"
+    }
+
+    class ImmunoassayBeadObservationTargetSample1 {
+        +beadId: 100238373678-1001
+        +targetHLA: HLA-A*01:01
+        +raw_mfi: 7650
+        +converted_mfi: 7500
+    }
+    class ImmunoassayBeadControlNegBeadSample1 {
+        +beadId: 100238373678-1002
+        +raw_mfi: 650
+        +converted_mfi: 500
+    }
+    class ImmunoassayBeadControlPosBeadSample1 {
+        +beadId: 100238373678-1003
+        +raw_mfi: 10000
+        +converted_mfi: 10000
+    }
+    class ImmunoassayBeadObservationTargetNegSerum1 {
+        +beadId: 100238373678-1004
+        +raw_mfi: 7650
+        +converted_mfi: 7500
+    }
+    class ImmunoassayBeadObservationNegBeadNegSerum1 {
+        +beadId: 100238373678-1005
+        +raw_mfi: 40
+        +converted_mfi: 40
+    }
+    class ImmunoassayBeadObservationPosBeadNegSerum1 {
+        +beadId: 100238373678-1006
+        +raw_mfi: 650
+        +converted_mfi: 750
+    }
+    class ImmunoassayBeadObservationTargetPosSerum1 {
+        +beadId: 100238373678-1007
+        +raw_mfi: 7650
+        +converted_mfi: 7500
+    }
+    class ImmunoassayBeadObservationNegBeadPosSerum1 {
+        +beadId: 100238373678-1008
+        +raw_mfi: 200
+        +converted_mfi: 250
+    }
+    class ImmunoassayBeadObservationPosBeadPosSerum1 {
+        +beadId: 100238373678-1009
+        +raw_mfi: 15000
+        +converted_mfi: 15000
+    }
+
+    class ImmunoassayKit {
+        +deviceId: 100238373678
+        +catalogRef: A-987243
+        +lotNumber: 8973
+    }
+
+%% Relationships
+    Patient <|--o HLAAntibodyDiagnosticReport
+    HLAAntibodyDiagnosticReport <|--o LaboratoryOrg
+    HLAAntibodyDiagnosticReport <|--o WorkingSample
+    HLAAntibodyDiagnosticReport <|--o ImmunoassayInterpretation
+    HLAAntibodyDiagnosticReport <|--o ImmunoassayKit
+
+    HLAAntibodyDiagnosticReport <|--o ImmunoassayBeadObservationTargetSample1
+
+    ImmunoassayBeadObservationTargetSample1 <|--o WorkingSample
+    ImmunoassayBeadControlNegBeadSample1    <|--o WorkingSample
+    ImmunoassayBeadControlPosBeadSample1    <|--o WorkingSample
+
+    ImmunoassayBeadObservationTargetNegSerum1 <|--o NegativeSerum
+    ImmunoassayBeadObservationNegBeadNegSerum1 <|--o NegativeSerum
+    ImmunoassayBeadObservationPosBeadNegSerum1 <|--o NegativeSerum
+
+    ImmunoassayBeadObservationTargetPosSerum1 <|--o PositiveSerum
+    ImmunoassayBeadObservationNegBeadPosSerum1 <|--o PositiveSerum
+    ImmunoassayBeadObservationPosBeadPosSerum1 <|--o PositiveSerum
+
+    ImmunoassayBeadObservationTargetSample1 <|--o ImmunoassayBeadControlNegBeadSample1
+    ImmunoassayBeadObservationTargetSample1 <|--o ImmunoassayBeadControlPosBeadSample1
+    ImmunoassayBeadObservationTargetSample1 <|--o ImmunoassayBeadObservationTargetNegSerum1
+    ImmunoassayBeadObservationTargetSample1 <|--o ImmunoassayBeadObservationNegBeadNegSerum1
+    ImmunoassayBeadObservationTargetSample1 <|--o ImmunoassayBeadObservationPosBeadNegSerum1
+    ImmunoassayBeadObservationTargetSample1 <|--o ImmunoassayBeadObservationTargetPosSerum1
+    ImmunoassayBeadObservationTargetSample1 <|--o ImmunoassayBeadObservationNegBeadPosSerum1
+    ImmunoassayBeadObservationTargetSample1 <|--o ImmunoassayBeadObservationPosBeadPosSerum1
+
 ```
